TicketGo/backend/controllers/BilheteController.php

    public function actionCreate()
    {
        $bilhete = new Bilhete();


        // vai buscar o evento id
        $evento_id = Yii::$app->request->get('evento_id');
        if (!$evento_id) {
            throw new \yii\web\BadRequestHttpException('O parâmetro evento_id é obrigatório.');
        }

        // vai buscar o evento pelo id
        $evento = Evento::findOne($evento_id);
        if (!$evento) {
            throw new \yii\web\NotFoundHttpException("Evento não encontrado.");
        }

        // vai buscar o local associado ao evento
        $local_id = $evento->local_id;
        if (!$local_id) {
            throw new \yii\web\NotFoundHttpException("Local associado ao evento não encontrado.");
        }


        $zonas = Zona::find()->where(['local_id' => $local_id])->all();
---
SELECT * FROM `Eventos` WHERE `id`='9'
SELECT * FROM `Zonas` WHERE `local_id`=1