TicketGo/backend/controllers/CategoriaController.php

    public function actionCreate()
    {
        $model = new Categoria();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `Categorias` (`nome`, `descricao`) VALUES ('Musica', 'Musica')