TicketGo/backend/controllers/EventoController.php

SELECT EXISTS(SELECT * FROM `Categorias` WHERE `Categorias`.`id`='7')
SELECT * FROM `Categorias`
INSERT INTO `Eventos` (`titulo`, `descricao`, `datainicio`, `datafim`, `local_id`, `categoria_id`) VALUES ('Evento Jose Cid', 'Bue top ganda teste', '2005-12-12T12:12', '1212-12-12T12:12', 1, 7)
---
    public function actionCreate()
    {
        //Verifica se o utilizador tem permissão para criar eventos
        if (!Yii::$app->user->can('createEvents')) {
            Yii::$app->session->setFlash('error', 'Não tem permissão para criar eventos.');
            return $this->redirect(['index']);
        }
        $model = new Evento();

        // Categorias bd
        $categorias = Categoria::find()->all();
        $locais = Local::find()->all(); // Buscar os locais


        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            //Guardar o Modelo na BD
            if ($model->save()) {

SELECT EXISTS(SELECT * FROM `Categorias` WHERE `Categorias`.`id`='7')
SELECT * FROM `Categorias`
---
    public function actionUpdate($id)
    {
        // Verifica se o utilizador tem permissão para editar eventos
        if (!Yii::$app->user->can('updateEvents')) {
            Yii::$app->session->setFlash('error', 'Não tem permissão para editar eventos.');
            return $this->redirect(['index']);
        }

        $model = $this->findModel($id);

        // Categorias e locais
        $categorias = Categoria::find()->all();

SELECT * FROM `Eventos` WHERE `id`='3'
DELETE FROM `Eventos` WHERE `id`=3
---
    public function actionDelete($id)
    {
        $event = Evento::findOne($id);

        if (!$event || !Yii::$app->user->can('deleteEvents', ['eventId' => $id])) {
            throw new ForbiddenHttpException('Não tem permissão para eliminar eventos.');
        }

        $event->delete();

SELECT * FROM `Eventos` WHERE `id`='6'
---
    protected function findModel($id)
    {
        if (($model = Evento::findOne($id)) !== null) {