TicketGo/backend/controllers/EventoController.php

    protected function findModel($id)
    {
        if (($model = Evento::findOne($id)) !== null) {
---
SELECT * FROM `Eventos` WHERE `id`='2'