TicketGo/backend/controllers/ZonaController.php

INSERT INTO `Zonas` (`local_id`, `lugar`, `porta`, `quantidadedisponivel`) VALUES (1, '3º Plateia', NULL, 80)
---
    public function actionCreate()
    {
        $local_id = Yii::$app->request->get('local_id');

        if (!$local_id) {
            throw new \yii\web\BadRequestHttpException('O parâmetro local_id é obrigatório.');
        }

        $local = Local::FindOne($local_id);
        if(!$local){
            throw new \yii\web\NotFoundHttpException('Local não encontrado');
        }

        $model = new Zona();
        $model->local_id = $local_id;

       if($model->load($this->request->post()) && $model->save()) {